[
    {
        "id": 1,
        "title": "IT Specialist",
        "description": "You have a passion for new technology and everything technical? /n You can become part of FactSet - one of the best fintech companies in Sofia. /n  /n FactSet is a global provider of integrated financial information, analytical applications, and industry-leading services with annual revenues exceeding $1.4 billion. /n  /n  /n As part of your work you will become proficient in the following technical areas: /n Cloud technologies /n SQL development and Database Administration /n Performance tuning /n Network Administration /n System Administration /n Market finance, Financial instruments, Asset Management /n Work with some of the biggest financial institutions in the world /n  /n Some of the technologies you will use in your daily work: /n Massive datasets and databases /n Linux/Windows, scripting, automation, scheduling /n SQL (PL/SQL, T-SQL) /n DBA (Oracle, MS SQL Server, PostgreSQL, Amazon Aurora) /n Amazon Web Services (AWS) /n Virtual Machines /n Clustering, Load Balancing /n J2EE (JMS and JMX) /n APIs (SOAP, REST), Web Services /n Security, Firewall concepts, VPN, Citrix, Netscaler, etc. /n  /n  /n Why choose FactSet? /n  /n At FactSet, exceptional talent fuels every aspect of our business, from the constantly evolving financial software we develop to the unrivaled client service at our core.  As we continue to grow, we rely on new ideas and creative thinking to maintain our position on the cutting-edge of financial services and software. /n  /n FactSet hires the best of the best in the financial technology industry.  /n Whether you are a college student, recent graduate, or working professional, product-facing or client-facing, you will dynamically contribute to FactSet’s flourishing business.  /n You will work with peers who are just as motivated and passionate as you are, in an environment that promotes team, personal and professional growth. /n  /n When you join our team, you’ll receive immediate responsibility and recognition for your work, and will be valued personally and professionally. As the financial services software industry continues to grow, so will the future of FactSet and its employees.  /n  /n  /n The company offers /n Full-time position  /n Attractive remuneration with annual bonus opportunity /n Social benefits: /n flexible hybrid work model: office & home /n full private health insurance including dental coverage for you and your family /n free meals /n free multi-sport card /n up to 25 days of vacation /n Unique career opportunity for the local market to build a career in an innovative industry /n Chance to enhance both technical expertise and business skills in a customer-centric organization /n Job training and learning opportunities /n Challenging and dynamic environment /n Work in an enthusiastic team of talented co-workers /n Generous pay for any overtime /n Great office location and work environment /n Possibility for work from home or a hybrid work arrangement (home, office) /n Great CSR (Corporate Social Responsibility) program /n Possibility to enroll in many BRG group (Business Resource Groups) /n Career development opportunities across our various locations worldwide /n   /n Who we are? /n  /n Our Team /n Our team based in Sofia is responsible for FactSet’s Performance and Reporting Solutions that are part of the FactSet family of products and services. FactSet’s performance and reporting multi-asset software solution is trusted by an ever-growing number of global asset managers with operations across North America, EMEA and APAC, including many of the top 50 asset and wealth managers who manage over 10 trillion USD of Assets under Management through our software on a daily basis. /n  /n Our Company /n For more than 40 years, the world’s investment professionals have trusted FactSet, across teams, across asset classes, and at every stage of the investment process. FactSet is a multinational financial data and software company listed on the New York Stock Exchange. It has annual revenues exceeding 1.4 billion USD with 60 offices in 24 countries worldwide. /n  /n FactSet was voted: /n Best Workplaces in Finance and Insurance, Fortune /n Best Large Workplaces in New York, Fortune and Great Place to Work /n Top Company for Graduates to Work for in the UK /n U.K.’s Best Workplaces, Great Place to Work /n One of the best Corporate Social Responsibility programs (CSR) /n Best Place to Work for LGBT Equality, Human Rights Campaign Foundation",
        "numOfLikes": 43,
        "type": "full-time",
        "category": "IT",
        "applied": [],
        "isActive": true,
        "acceptedUser": null
    },
    {
        "id": 2,
        "title": "Domino's Pizza chef",
        "description": "CULTURE /n Domino’s began humbly in 1960, with a history of starting small but dreaming big, which remains at the core of our brand. Hard work, ambition and a passion for pizza have always fed the power of what’s possible at Domino’s. We are a company built on innovative solutions and a belief that we are never done getting better, we embrace change and the potential it unlocks for everyone. /n We are focused on developing an inclusive culture, with dignity and respect for all, where team members can grow, thrive and bring their best selves to work every day. The diversity of our workforce is what helps to make us an enduring brand, where we can grow and thrive together. /n  BENEFITS & WELLNESS /n SUPPORTING YOUR HEALTH AND WELLBEING /n Medical, Dental, Vision and Prescription Drug Coverage /n Flexible Spending and Health Savings Accounts (FSA/HSA) /n Education Assistance /n Financial Benefits /n Paid Time Off /n Mental Health and Family Support /n Team Member Discounts /n The benefits information above applies only to eligible corporate team members. Benefits programs offered by Domino's franchisees will vary from franchise to franchise.",
        "numOfLikes": 13,
        "type": "part-time",
        "category": "Food industry",
        "applied": [],
        "isActive": true,
        "acceptedUser": null
    },
    {
        "id": 3,
        "title": "English Teacher Children Full-Time Position",
        "description": "Would you like to join our BRITANICA community? /n BRITANICA Mission /n Leading others through service is the key to happiness. Our sole purpose is to make a difference in children’s lives by teaching the whole child. We challenge ourselves every day to go the extra mile to teach /n general life skills, e.g. the ability of being proactive, the growth mindset, time management, communication, leadership, and teamwork /n the general skills students need to become lifelong learners, e.g. intellectual curiosity and problem solving. /n the skill of empathy and the ability to work cooperatively on projects with common goals. /n For new teachers who seek support and want to embrace the challenges and triumphs of first starting out in the classroom, we offer innovative academic programmes which will help them grow into confident professionals. /n Join our team of Educational Leaders /n Our Expert Teachers and Educational Leaders will welcome every applicant who loves leading children and favours collaborative learning. /n You want to make a difference and educate the future leaders of Bulgaria, join us. /n You want to develop better organisational skills and grow into a mindful educational leader, join us. /n An advantage would be: /n Obtained teaching certificates (CELTA, TEFL); /n Obtained Cambridge certificates (CAE, CPE, IELTS); /n Previous teaching experience; /n Experience with working with children. /n We would be happy to offer: /n Full time position - 40 hours a week (standard employment contract); /n Work for the market leader for English language education; /n Ongoing training using the latest and most modern methods; /n Professional development opportunities; /n Participation in workshops/seminars and other extra curricular activities organized by BRITANICA. /n Join our team of young Educational Leaders and help BRITANICA grow into even stronger Educational Community. You can make a difference! /n Please send us your CV and a cover letter. /n Only the successful candidates will be invited for personal interviews.",
        "numOfLikes": 10,
        "type": "full-time",
        "category": "Education",
        "applied": [],
        "isActive": true,
        "acceptedUser": null
    },
    {
        "id": 4,
        "title": "Product Designer, Skrill & NETELLER",
        "description": "Paysafe Limited (“Paysafe”) (NYSE:PSFE) (PSFE.WS) is a leading specialized payments platform. Its core purpose is to enable businesses and consumers to connect and transact seamlessly through industry-leading capabilities in payment processing, digital wallet, and online cash solutions. /n The multinational UX/UI Team at Paysafe is on a mission to create impeccable industry-setting user experience in the FinTech sector. /n  /n We work inseparably from product, insights, risk and marketing to envision new features, create the information architecture, scalable user interface, exquisite tone of voice and test, test, test on all stages of the product development. Our current focus is both the web and mobile applications for the digital wallets - Skrill and NETELLER and their crypto functionalities. /n  /n We’re looking for a Product designer for our UX/UI team who tells cohesive, well-thought and user tested stories through mind maps, user flows and ultimately, prototypes. They are able to gather requirements from concerned departments, work together with the product team and create a compelling presentation to stakeholders. /n  /n What to expect: /n Promote practices in empathising with users within the product team - work with researchers to define the research question and complete the user journey, draw insights from heatmaps, HotJar recordings, qualitative and quantitative data /n Define opportunities for improvements and new features on the product based on identified user needs /n Ideate by themselves and in groups (organize or help organizing design thinking workshops, design sprints) /n Create interactive prototypes to flesh out the ideas /n Test prototypes to validate the ideas and usability /n Monitor performance of flows and constantly repeat the cycle to optimise the experience /n To be successful you need to (have): /n Help conduct moderated and unmoderated user tests to set up proper personas and customer journey maps /n Create high fidelity interactive prototypes /n Help organise meetings, workshops and design sprints to ensure involvement of stakeholders and robust end results /n 3+ years of UX experience in web and mobile /n Strong portfolio with case studies of approach to product creation is a plus /n Understanding of the gaming/sports betting market is a plus /n Knowledge about the basics of the payment industry is a plus /n UX trainings, design thinking and design sprint experience is a plus /n It would be an advantage if you're a crypto enthusiast. /n We offer in return: /n The opportunity to write the history of a leading and growing multinational company. /n Tailor-made training and ongoing development to help you enhance your skills in the field of online payments. /n Multiple career progression opportunities in a dynamic in-house business. /n Environment where product expertise, professional and personal commitment are rewarded. /n Competitive remuneration and social benefits package (25 days annual paid leave, health insurance, sports card, team events, company discounts, variety of soft skills, business and technical training programs). /n Fun and collaborative working atmosphere. /n One of the top 10 best designed offices in the world. /n With offices in Canada, USA, EU, India, and the UK, Paysafe Group offers individuals an opportunity to join a fast-moving global company with energy, passion and drive, committed to developing world-class online financial solutions. /n  /n We take pride in our employees and offer excellent remuneration and benefits, as well as a positive, rewarding and fun work environment. /n  /n Are you ready to take your career to the next level? Join our team that is inspired by a unified vision and propelled by passion. /n  /n Send your CV and digital portfolio in English. /n  /n Only shortlisted candidates will be contacted for an interview. /n  /n Equal Employment Opportunity /n Paysafe provides equal employment opportunities to all employees, and applicants for employment, and prohibits discrimination of any type with regard to ethnicity, religion, age, sex, national origin, disability status, sexual orientation, gender identity or expression, or any other protected characteristics. This policy applies to all terms and conditions of recruitment and employment. If you need any reasonable adjustments please let us know. We will be happy to help and look forward to hearing from you.",
        "numOfLikes": 27,
        "type": "full-time",
        "category": "Web Design",
        "applied": [],
        "isActive": true,
        "acceptedUser": null
    },
    {
        "id": 5,
        "title": "Player Support Specialist with Turkish and English",
        "description": "If you are passionate about gaming, join our growing Game Support team in the biggest BPO provider in Bulgaria - get the job you will enjoy! /n A typical day: /n Be every player's trusty advisor /n Listen and respond to gamers' queries via phone email /n Identify and assess customers’ needs to achieve satisfaction /n Sounds good, right?  /n If you have: /n Fluency in Turkish and a good command of English /n Gaming experience - you have played games recently and you can relate to a player’s concept, community, and mindset /n Player empathy and understanding a player’s perspective when tackling their issues  /n Understanding of Player Support /n Desire to help the players as best as possible and to contribute to the team’s success  /n We offer: /n Attractive salary /n A supportive environment that values collaboration with great energy /n Career development opportunities /n International modern working environment (Relax zones, PlayStation) /n Special benefits for our team members (e.g. gym, yoga classes, massages and corporate psychologist in the office and many others) /n Additional health insurance & Transportation allowance /n Employee referral bonuses & Recognition programs /n Supportive work-life balance policies assistance and learning /n We care about the well–being of our employees, invest in their future growth, encourage fun and team-building projects! /n Does it sound like the perfect job for you? APPLY NOW! /n About us: TELUS International Bulgaria is the leader in the BPO sector with a team of over 3800 people in Sofia and Plovdiv. We have almost 55,000 team members across 20 countries. TELUS International Bulgaria offers contact center solutions, ITO, and creative customer service support for global customers in over 50 languages.",
        "numOfLikes": 43,
        "type": "remote",
        "category": "Customer Service",
        "applied": [],
        "isActive": true,
        "acceptedUser": null
    }
]
